In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/friend_list.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'data/friend_list.csv'

In [5]:
df = pd.read_csv('Desktop/data/friend_list.csv')  #df 변수에 파일 데이터 저장

In [6]:
df = pd.read_csv('desktop/data/friend_list.csv')

In [7]:
df = pd.read_csv('C:\Users\user\Desktop\data\friend_list.txt')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (<ipython-input-7-d00aa0ef90bd>, line 1)

In [8]:
df  #변수에 저장한 csv데이터 불러옴

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [9]:
df = pd.read_csv('desktop/data/friend_list.txt')   #txt확장자 파일 데이터 저장

In [10]:
df  #df에 저장된 데이터 불러오기

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
df.head()  #처음부터 5개까지의 데이터만 보여줌

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [12]:
df.head(2)   #처음부터 2개까지의 데이터만 보여줌

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [13]:
df.tail()  #뒤에서부터 5개 데이터 보여줌

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [14]:
df.tail(3)   #뒤에서부터 3개

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [16]:
df = pd.read_csv('desktop/data/friend_list_tab.txt', delimiter = '\t')  #데이터가 tab으로 구분되어 있을 때

In [17]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [19]:
df = pd.read_csv('desktop/data/friend_list_no_head.csv')  #head가 없는 데이터 불러오기

In [20]:
df   #헤더에 데이터가 들어감

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [21]:
df = pd.read_csv('desktop/data/friend_list_no_head.csv', header = None)  #head가 없다고 알려줌

In [22]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [23]:
df.columns = ['name', 'age', 'job']  #head name 설정해줌

In [24]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
df = pd.read_csv('desktop/data/friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'] )  #h위에 두 단계 한 번에 하기

In [27]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern